perf/perf-test.yml
config:
  target: "http://localhost:3000"
  engines:
    playwright: {}
  processor: "../tests/performance-steps.ts"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Sustained Load"

scenarios:
  - name: "High Latency Simulation"
    engine: playwright
    testFunction: "runPerformanceFlow"